# Linear Regression Multivariate

#Use hiring.csv. 
This file contains hiring statics for a firm such as experience of candidate, 
his written test score and personal interview score. Based on these 3 factors,
HR will decide the salary. 

Given this data, you need to build a machine learning model for HR department that 
can help them decide salaries for future candidates. Using this predict salaries for following candidates,

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

Answer
53713.86 and 93747.79

In [32]:
pip install word2number

Requirement already satisfied: word2number in c:\users\ravis1\anaconda3\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [57]:
import numpy as np
import pandas as pd
from sklearn import linear_model

In [58]:
#set_option is used to display number of rows- user speific
pd. set_option('display.max_rows', None) 
df = pd.read_csv("hiring.csv")
print(df)

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [59]:
df.experience = df.experience.fillna('zero')
df.experience

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [60]:
df
#this displays entire dataframe

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [61]:
#install and use the word to number to convert the words to number values
from word2number import w2n
df.experience = df.experience.apply(w2n.word_to_num)

In [62]:
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         NaN                7   72000
7          11         7.0                8   80000

In [65]:
# fill the NaN values with mean of the columns values
import math
median_test_score = math.floor(df['test_score'].mean())
median_test_score

7

In [69]:
df['test_score'] = df['test_score'].fillna(median_test_score)
df['test_score']

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     7.0
7     7.0
Name: test_score, dtype: float64

In [ ]:
#by now all NaN are filled with values and the words are converted to numbers

In [70]:
df

   experience  test_score  interview_score  salary
0           0         8.0                9   50000
1           0         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         7.0                7   72000
7          11         7.0                8   80000

In [72]:
regression = linear_model.LinearRegression()
regression.fit(df[['experience','test_score','interview_score']],df['salary'])

LinearRegression()

In [76]:
regression.predict([[2,9,6]])

array([53713.86677124])

In [77]:
regression.predict([[12,10,10]])

array([93747.79628651])